-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3307
-- Generation Time: Mar 15, 2024 at 08:47 AM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tokio`
--

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `id` int(11) NOT NULL,
  `assistant_content` text DEFAULT NULL,
  `system_content` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `assistant_content`, `system_content`, `created_at`) VALUES
(2, 'ค่าใช้จ่ายในการสอบ IC License เท่าไหร่ ?', 'ค่าสมัครสอบเพื่อขอใบอนุญาตตัวแทนครั้งละ 1200 บาท', '2024-03-08 07:28:55'),
(4, 'เบอร์ติดต่อบริษัทโตเกียวมารีน', 'ติดต่อสอบถามข้อมูลได้ที่ 02-619-1400', '2024-03-08 07:51:38'),
(8, 'ติดต่อเจ้าหน้าที่แผนกบริหารตัวแทน', 'ติดต่อเจ้าหน้าที่แผนกบริหารตัวแทนได้ที่ 02-619-4015, 4016, 4017', '2024-03-15 06:25:56'),
(9, 'ติดต่อเจ้าหน้าที่ฝ่ายสนับสนุนตัวแทน', 'ติดต่อเจ้าหน้าที่ส่วนงานคุณวุฒิตัวแทนได้ที่ 02-619-4034 \\n ติดต่อเจ้าหน้าที่ส่วนงานบริหารผลประโยชน์ตัวแทนได้ที่ 02-619-4033 \\n ติดต่อเจ้าหน้าที่ส่วนงานบริหารงานสาขาได้ที่ 02-619-4037', '2024-03-15 06:44:23'),
(10, 'ติดต่อเจ้าหน้าที่ฝ่ายการตลาดและประชาสัมพันธ์องค์กร', 'ติดต่อเจ้าหน้าที่ส่วนงานสนับสนุนการตลาดได้ที่ 02-619-4024, 4481, 4028 \\n ติดต่อเจ้าหน้าที่ส่วนงานสื่อสารองค์กรได้ที่ 02-619-4021 \\n ติดต่อเจ้าหน้าที่ส่วนงานส่งเสริมการตลาดได้ที่ 02-619-4027, 4035', '2024-03-15 06:46:41'),
(12, 'ใช้เวลาจัดส่งสินค้าภายในกี่วัน', 'ท่านสามารถรับสินค้าของพรีเมี่ยมได้ภายใน 3-5 วันทำการ', '2024-03-15 06:58:56'),
(13, 'กรมธรรม์ติด MEMO ตัวแทนจะทราบได้อย่างไร ?', 'ตัวแทนจะได้รับ SMS แจ้งเลขกรมธรรม์ที่ติด Memo จากทางฝ่ายพิจารณา', '2024-03-15 06:59:12'),
(14, 'การส่ง Memo ต้องส่งผ่านช่องทางใด ?', 'ส่งผ่านอีเมลฝ่ายบริหารงานตัวแทน กรณีส่งเอกสารเพิ่ม ที่ sale-co@tokiomarinelife.co.th', '2024-03-15 06:59:39'),
(15, 'จ่ายผลประโยชน์กี่รอบ รอบใดบ้าง ?', 'การจ่ายผลตอบแทน ทางบริษัทจะดำเนินการจ่ายเป็นรายสัปดาห์ รายเดือน รายไตรมาส ครึ่งปี และรอบปี', '2024-03-15 06:59:54'),
(16, 'หากมีแคมเปญ จ่ายเพิ่ม Bonus สำหรับตัวแทน ติดตามข่าวสารช่องทางใด ?', 'สามารถติดตามประกาศผ่าน Agent Web ได้ที่ลิงค์นี้ https://agweb.tokiomarinelife.co.th/agweb-v2', '2024-03-15 07:00:09'),
(17, 'กรณีสอบถามผลการจ่ายผลประโยชน์ หรือมีคำถามสงสัย ติดต่อช่องทางใด ?', 'ท่านสามารถติดต่อผ่าน Call Center เพื่อติดต่อฝ่ายสนับสนุนตัวแทน หรือ ติดต่อสำนักงานใหญ่ บมจ.โตเกียวมารีนประกันชีวิต (ประเทศไทย) ณ อาคารเอ็มไพร์ทาวเวอร์ ชั้น 25', '2024-03-15 07:00:24'),
(18, 'กรณีตัวแทนใหม่ สอบถามการใช้งานระบบต่างๆ ติดต่อส่วนงานใด ?', '1. Download คู่มือผ่าน https://agweb.tokiomarinelife.co.th/agweb-v2 \\n 2. โทร Call center แจ้ง ติดต่อฝ่ายสนับสนุนตัวแทน \\n 3. สอบถามฝ่ายฝึกอบรม กรณีระบบนั้นมีเปิดรอบสอนการใช้งาน สามารถลงทะเบียนได้', '2024-03-15 07:07:04'),
(19, 'กรณีตัวแทนส่ง Link EKYC ให้ลูกค้า เพื่อยืนยันตัวตน แต่ไม่สำเร็จมีสาเหตุใดบ้าง ?', 'Link EKYC สาเหตุอาจเกิดได้จาก 4 ปัจจัย ดังนี้ \\n ลูกค้าทำไม่ถูกต้องตามวิธีการ \\n บัตรประชาชนของลูกค้าหมดอายุ \\n บัตรประชาชนไม่ใช่ใบปัจจุบัน \\n บัตรประชาชนมีรอนขีดข่วนจนไม่สามารถตรวจสอบข้อมูลได้', '2024-03-15 07:08:43'),
(20, 'การชำระเงินกรมธรรม์ ลูกค้าสามารถชำระผ่านช่องทางใดได้บ้าง ?', 'ลูกค้าสามารถชำระเงินกรมธรรม์ได้ 3 ช่องทาง ดังนี้ \\n 1.QR code \\n 2.โอนเงินเข้าบัญชีบริษัทฯ \\n 3.บัตรเครดิต โดยทุกวิธีสามารถทำผ่านทาง ตัวแทน / สาขาของบริษัทโตเกียวมารีน', '2024-03-15 07:09:11'),
(21, 'การสอบถาม / แก้ไข / สมัครสอบ หรือเรื่องที่เกียวกับข้อมูลตัวแทน ทำอย่างไร ?', 'โทร Call center แจ้ง ติดต่อฝ่ายสนับสนุนตัวแทน จะมีฝ่ายดูแลข้อมูลตัวแทนเป็นผู้ให้ข้อมูลโดยเฉพาะ', '2024-03-15 07:09:31'),
(22, 'การเปลี่ยนแปลงข้อมูลตัวแทน เช่น เบอร์ อีเมล ทำอย่างไร ?', 'การเปลี่ยนแปลงข้อมูลตัวแทน Download ใบคำขอเปลี่ยนแปลงผ่าน https://agweb.tokiomarinelife.co.th/agweb-v2 และนำเอกสารตัวจริง ส่งมาที่สาขา หรือ ส่งไปรษณีย์มายังสำนักงานใหญ่', '2024-03-15 07:11:08'),
(23, 'ตัวแทนสามารถย้ายหน่วยงานภายในได้หรือไม่ ?', 'ไม่สามารถดำเนินการได้', '2024-03-15 07:11:24'),
(24, 'เมือสอบผ่าน ใช้เวลากี่วันถึงจะสามารถขายประกันได้ ?', 'เมื่อสอบผ่าน และได้รับการออก Code ตัวแทนกับทางบริษัทฯ ท่านสามารถขายประกันได้ในวันรุ่งขึ้นทันที', '2024-03-15 07:13:49'),
(25, 'สนใจสมัครเป็นตัวแทนโตเกียวมารีน ?', 'สนใจสมัครเป็นตัวแทนได้ที่เว็บไซต์ Agent Web หรือ คลิก https://agweb.tokiomarinelife.co.th/agweb-v2/', '2024-03-15 07:14:31'),
(26, 'เอกสารประกอบการสมัครเป็นตัวแทนใหม่โตเกียวมารีน ?', 'เอกสารประกอบการสมัครขอใบรับรองอนุญาตตัวแทนประกันชีวิต (ใหม่) ประกอบด้วย \\n 1. รูปถ่ายขนาด 1 นิ้ว จำนวน 4 รูป (ไม่เกิน 6 เดือน)\\n 2. สำเนาบัตรประจำตัวประชาชน หรือ บัตรข้าราชการ จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 3. สำเนาทะเบียนบ้าน จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 4. สำเนาหลักฐานเปลี่ยนชื่อ-สกุล (ถ้ามี) จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 5. หนังสือแจ้งหมายเลขบัญชีธนาคาร พร้อมสำเนาสมุดเงินฝากธนาคาร พร้อมรับรองสำเนาถูกต้อง \\n 6. ค่าธรรมเนียมการออกใบอนุญาต 300 บาท', '2024-03-15 07:15:03'),
(27, 'เอกสารประกอบการต่ออายุเป็นตัวแทนโตเกียวมารีน ?', 'ในกรณีที่ใบอนุญาตบริษัทขาดการต่ออายุ สามารถยื่นเอกสารโดยไม่ต้องสอบใหม่ ดังนี้ \\n 1. รูปถ่ายขนาด 1 นิ้ว จำนวน 4 รูป (ไม่เกิน 6 เดือน) \\n 2. สำเนาบัตรประจำตัวประชาชน หรือ บัตรข้าราชการ จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 3. สำเนาทะเบียนบ้าน จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 4. สำเนาหลักฐานเปลี่ยนชื่อ-สกุล (ถ้ามี) จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \\n 5. หนังสือแจ้งหมายเลขบัญชีธนาคาร พร้อมสำเนาสมุดเงินฝากธนาคาร พร้อมรับรองสำเนาถูกต้อง \\n 6. ค่าธรรมเนียมการออกใบอนุญาต 300 บาท', '2024-03-15 07:16:00'),
(28, 'ติดต่อผลการสมัครเป็นตัวแทนโตเกียวมารีน ?\"', 'ท่านสามารถติดต่อผ่านผู้บริหารที่แนะนำท่านมา เพื่อแจ้งผลการยื่นขอใบรับรองอนุญาตตัวแทนประกันชีวิต', '2024-03-15 07:16:34'),
(29, 'ขั้นตอนการสมัครสอบ IC License ทำอย่างไรบ้าง ?', 'ขั้นตอนการสมัครสอบ IC License ท่านสามารถสมัครสอบได้ที่สถาบัน ATI โดยคุณสมบัติผู้สมัครสอบต้องจบปริญญาตรีขึ้นไป', '2024-03-15 07:16:48'),
(30, 'ใช้เวลาประมาณกี่วัน ถึงจะทราบผลสอบ IC License ?', 'ท่านสามารถทราบผลทันทีหลังการสอบออนไลน์', '2024-03-15 07:17:16'),
(31, 'วิธีการตรวจสอบค่าคอมมิชชั่นทำได้อย่างไร ?', 'ท่านสามารถตรวจสอบข้อมูลการสอบได้ที่ Agent Web ในหัวข้อบัญชีตัวแทน เพื่อตรวจสอบข้อมูล', '2024-03-15 07:17:31'),
(32, 'ช่องทางการตรวจสอบสถานะ MEMO ?', 'ท่านสามารถตรวจสอบสถานะการขอ MEMO ได้ 2 ช่องทาง คือ \\n 1. ช่องทาง SMS \\n 2. ผ่านระบบ Agentcy Web หัวข้อสถานะใบคำขอใหม่', '2024-03-15 07:17:51'),
(33, 'ตรวจสอบสถานะการขอรับใบอนุญาตตัวแทน และการขอต่อใบอนุญาตตัวแทนได้อย่างไร ?', 'ท่านสามารถตรวจสอบข้อมูลการสอบได้ที่ Agent Web ในหัวข้อบริการออนไลน์ \\\"ERC\\\" เพื่อตรวจสอบข้อมูล', '2024-03-15 07:18:08'),
(34, 'สั่งซื้อของพรีเมี่ยมได้อย่างไร ?', 'สามารถสั่งซื้อสินค้าของพรีเมี่ยมได้ง่ายๆ เพียงคลิกลิงค์ https://www.tokiomarinelife.co.th/premium-gift/user/login?user=QXJad3JrSkN1VTZNaXNHenV6RDBiUT09', '2024-03-15 07:18:26'),
(35, 'ขั้นตอนการสั่งซื้อของพรีเมี่ยมทำอย่างไร ?', 'ท่านสามารถสั่งซื้อสินค้าพรีเมี่ยมได้ง่ายๆ เพียง \\n 1. เข้าเว็บไซต์ Agent Web \\n 2. เลือกเมนู Premium Gift Online \\n 3. เลือกสินค้าที่ต้องการ \\n 4. ระบุที่จัดส่ง พร้อมกรอกข้อมูลการออกใบกำกับภาษี \\n 5. เลือกวิธีการจัดส่งสินค้า \\n 6. ตรวจสอบข้อมูล สรุปรายการสั่งซื้อ \\n 7. เลือกวิธีการการชำระเงิน (บัตรเครดิต / สแกน QR Code)', '2024-03-15 07:18:42'),
(36, 'รับสินค้าของพรีเมี่ยมได้ที่ใด ?', 'สามารถเลือกรับสินค้าได้ 2 ช่องทาง คือ จัดส่งทางไปรษณี และ กำหนดรับได้ที่สาขาใกล้เคียง', '2024-03-15 07:18:58'),
(37, 'ติดตามสถานะสินค้าพรีเมี่ยมได้อย่างไร ?', 'ท่านสามารถติดตามสถานะการสั่งซื้อได้โดยนำ Tracking Number ไปค้นหาสถานะได้ที่ระบบไปรษณีไทย หรือ DHL', '2024-03-15 07:19:17'),
(38, 'เข้าสู่ระบบ Agent Web ได้อย่างไร ?', 'ท่านสามารถเข้าสู่เว็บไซต์ได้ง่ายๆ เพียงคลิกลิงค์ https://agweb.tokiomarinelife.co.th/agweb-v2/', '2024-03-15 07:19:34'),
(39, 'การเข้าใช้งานระบบ Agent Web ทำอย่างไร ?', 'ท่านสามารถเข้าสู่ระบบได้ง่ายๆ เพียงกรอกข้อมูล \\\"รหัสตัวแทน และ รหัสผ่าน\\\" ได้ที่ https://agweb.tokiomarinelife.co.th/agweb-v2/login', '2024-03-15 07:19:50'),
(40, 'สอบถามข่าวประชาสัมพันธ์บริษัท ?', 'ท่านสามารถติดตามข่าวประชาสัมพันธ์บริษัทได้ที่ https://agweb.tokiomarinelife.co.th/agweb-v2/news', '2024-03-15 07:20:37'),
(41, 'ตรวจสอบรายการฝึกอบรมทางบริษัททำอย่างไร ?', 'ท่านสามารถตรวจสอบตารางการอบรมประจำเดือนได้ที่ Agent Web หรือ คลิก  https://agweb.tokiomarinelife.co.th/agweb-v2/training/monthly', '2024-03-15 07:23:21'),
(42, 'เข้าอบรมกับทางบริษัทได้อย่างไร ?', 'ท่านสามารถเข้าร่วมการอบรมผ่านระบบ LMS โดยคลิกที่เมนูการอบรมประจำเดือน เพื่อเข้าสู่ระบบ หรือ คลิก https://tokiomarinelife.e-learningportal.com/', '2024-03-15 07:25:05'),
(43, 'เข้าระบบ LMS ไม่ได้ ?', 'ในกรณีที่ท่านไม่สามารถเข้าสู่ระบบ LMS ได้ กรณีติดต่อเจ้าหน้าที่เพื่อตรวจสอบและยืนยันการเป็นตัวแทนได้ที่อีเมล์ Tadsanee.Put@tokiomarinelife.co.th', '2024-03-15 07:25:29'),
(44, 'ติดต่อเรื่องการอบรมบริษัท ?', 'ท่านสามารถติดต่อเจ้าหน้าที่แผนกฝึกอบรมได้ที่ 02-619-6817', '2024-03-15 07:25:42'),
(45, 'ตรวจสอบทริปและโปรโมชั่นจากที่ใด ?', 'ท่านสามารถตรวจสอบรายละเอียดโปรโมชั่นได้ที่ Agent Web หรือ คลิก https://agweb.tokiomarinelife.co.th/agweb-v2/', '2024-03-15 07:25:57'),
(46, 'การเข้าฟังวิชาการออนไลน์สโมสรโตเกียวคลับต้องทำอย่างไร ?', 'ท่านสามารถเข้าร่วมเป็นสมาชิกเพื่อรับฟังวิชาการออนไลน์ / ติดตามข่าวสารได้ง่ายๆ เพียง \\n 1. เข้าสู่ระบบ Facebook \\n 2. ค้นหากลุ่ม Tokio Marine Life Open House \\n 3. กดเข้าร่วมกลุ่ม พร้อมตอบคำถาม 3 ข้อ \\n 4. รอการยืนยันจากเจ้าหน้าที่', '2024-03-15 07:26:32');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
